src/DataProcessors/ОткрытиеЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиеЗакрытиеСмены</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОткрытияСмены</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивБригад</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивУдаленных</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пейджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ТекущиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСмены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеСмены</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ОткрытиеЗакрытиеСмены/Forms/ОтменаЗакрытия/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем Закрытие;



Процедура ПриОткрытии()
	
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();
	
КонецПроцедуры


Процедура КнопкаОтменитьЗакрытиеНажатие(Элемент)
	Закрытие.Смена = Документы.ОткрытиеСмены.ПустаяСсылка();
	Закрытие.Дата = Дата(1901,1,1);
	Закрытие.Записать();
	Закрыть();
	
	ТекСмена = РегистрыСведений.ТекущиеСмены.Получить(Новый Структура("МестоРеализации", глПараметрыРМ.МестоРеализации )).Смена;
	ТекСменаЗапрос = ИнтерфейсРМ.ТекущаяСменаЗапрос();
	Если ТекСменаЗапрос <> ТекСмена Тогда
		МенеджерЗаписи = РегистрыСведений.ТекущиеСмены.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.МестоРеализации = глПараметрыРМ.МестоРеализации;
		МенеджерЗаписи.Смена = ТекСменаЗапрос;
		ИнтерфейсРМ.ПопыткаДействияСОбъектом( МенеджерЗаписи, "Объект.Записать()" );
		
	КонецЕсли; 
	//глПараметрыРМ.Вставить("НомерСмены", ИнтерфейсРМ.ТекущаяСмена().Номер);

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗакрытиеСмены.Ссылка КАК Закрытие,
	|	ЗакрытиеСмены.Смена КАК Открытие
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.МестоРеализации = &МестоРеализации
	|	И НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Смена.Дата, ДЕНЬ) = &Дата");	
	
	Запрос.УстановитьПараметр("МестоРеализации", глПараметрыРМ.МестоРеализации);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаНаСервере()));
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка","Нечего отменять", "В текущей календарной дате по " + глПараметрыРМ.МестоРеализации  + "
		|нет закрытых смен!","","ОК","");
		Отказ = Истина;
	Иначе
		
		ТЗ = Рез.Выгрузить();
		Закрытие = ТЗ[0].Закрытие.ПолучитьОбъект(); //Закрытие//: Документ.ЗакрытиеСмены
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаВыходНажатие(Элемент)
	Закрыть();
КонецПроцедуры


ПараметрыОкна = Новый Структура("Центр, Лево, Верх, Ширина, Высота", Истина);

ЭтоОткрытиеСмены = Ложь;
ОткрытиеСменыВыполнено = Ложь;
